import re

def doubles(str):
    pattern = r'\b([^\W\d_]+)(\s+\1)+\b'
    return re.sub(pattern, r'\1', re.sub(r'\s+', ' ', str).strip(), flags=re.I)

def vowels(str):
    pattern = r'\b([бвгджзйклмнпрстфхцчшщъьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЪЬ]*([аеёиоуыэюяАЕЁИОУЫЭЮЯ])(?:\2*[бвгджзйклмнпрстфхцчшщъьБВГДЖЗЙКЛМНПРСТФХЦЧШЩЪЬ]*)*)\b'
    res = re.findall(pattern, str)
    a = []
    for i in res:
        a.append(i[0])
    b = sorted(a, key=len)
    for i in b:
        print(i)
    print('\n')


# ;<{\ (134)
print('№1')
pattern = re.compile(r';<{\\')
print(len(pattern.findall(';<{\;<{\;<{\;<{\;<{\\')) == 5)
print(len(pattern.findall(';<{\\;<{\\\\;<\{\;<')) == 2)
print(len(pattern.findall(';<{\';<}/=;<{\1')) == 0)
print(len(pattern.findall(';<{\ ;<{\;< {\;<{\\\'')) == 3)
print(len(pattern.findall(';<{\n;<{\r;<{\\s;<{\\')) == 2)

print('\n№2')
print(doubles('Довольно распространённая ошибка ошибка – это повтор слова.'))
print(doubles('Довольно распространённая ошибка ошибка – это лишний повтор повтор слова слова. Смешно, не не правда ли? Не нужно портить хор хоровод.'))
print(doubles('Довольно довольно распространённая ошибка ошибка – это повтор слова.'))
print(doubles('Смешно, не      не правда ли ли?'))
print(doubles('Смешно смешно, не не правда ли лии?'))

print('\n№3')
vowels('Классное слово – обороноспособность, которое должно идти после слов: трава и молоко')
vowels('Смешно, не не правда ли ли?')
vowels(doubles('Смешно, не не правда ли ли?'))
vowels('Смешн0, не правда ли?')
vowels('Смешно, не нее правда ли л?')


# "(?P<code>[+](?:124[26]|126[48]|1284|134[05]|1441|1473|16(?:49|58|64|70|71|84)|17(?:21|58|67|70|84|87)|18(?:09|29|49|68|69|76)|1939|2[1234569][0-9]|3[578][0-9]|42[0-9]|5[09][0-9]|6[789][0-9]|8[0578]0-9]|9[679][0-9]|2[078]|3[0123469]|4[134567890]|5[1-8]|6[0-6]|7[346789]|8[123469]|9[0123458]|[7|1])|8)(?:[0-9]{10})"gm
# (?:(\+(?:124[26]|126[48]|1284|134[05]|1441|1473|16(?:49|58|64|70|71|84)|17(?:21|58|67|70|84|87)|18(?:09|29|49|68|69|76)|1939|2[1234569][0-9]|3[578][0-9]|42[0-9]|5[09][0-9]|6[789][0-9]|8[0578]0-9]|9[679][0-9]|2[078]|3[0123469]|4[134567890]|5[1-8]|6[0-6]|7[346789]|8[123469]|9[0123458]|[7|1])|8)([0-9]{10}))|(?:(\+(?:124[26]|126[48]|1284|134[05]|1441|1473|16(?:49|58|64|70|71|84)|17(?:21|58|67|70|84|87)|18(?:09|29|49|68|69|76)|1939|2[1234569][0-9]|3[578][0-9]|42[0-9]|5[09][0-9]|6[789][0-9]|8[0578]0-9]|9[679][0-9]|2[078]|3[0123469]|4[134567890]|5[1-8]|6[0-6]|7[346789]|8[123469]|9[0123458]|[7|1])|8)\([0-9]{3}\)[0-9]{3}\-[0-9]{2}\-[0-9]{2})